Dlubal.RFEM5.ContactSolid
Contact solid parameters

Dlubal.RFEM5.ContactSolid.General
General parameters

Dlubal.RFEM5.ContactSolid.SurfaceANo
Contact surface A

Dlubal.RFEM5.ContactSolid.SurfaceBNo
Contact surface B (read only)

Dlubal.RFEM5.ContactSolid.Perpendicular
Contact perpendicular to surfaces

Dlubal.RFEM5.ContactSolid.Parallel
Contact parallel to surfaces

Dlubal.RFEM5.ContactSolid.SpringStiffness
Spring stiffness parameter C

Dlubal.RFEM5.ContactSolid.CoulombFrictionFactor
Parallel contact parameter μ

Dlubal.RFEM5.ContactSolid.ShearStress
Shear stress parameter τmax